GetBoxCenter Method
 Returns the center of the outline of the viewport on the sheet, excluding the viewport label.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public XYZ GetBoxCenter()
Visual Basic
Public Function GetBoxCenter As XYZ
Visual C++
public:
XYZ^ GetBoxCenter()
Return Value
 The center of the outline of the viewport on the sheet.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsInvalidOperationException |  The viewport is not on a sheet.
See Also
Viewport Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →